const 原始数据 = Object.freeze([
  朝代("夏", -2070, -1600),
  朝代("商", -1600, -1046),
  {"周": [
    朝代("西周", -1046, -771),
    朝代("东周", -770, -256),
    朝代("春秋时代", -770, -476),
    朝代("战国时代", -475, -221),
  ]},
  朝代("秦", -221, -206),
  {"汉": [
    朝代("西汉", -206, 25),
    朝代("东汉", 25, 220),
  ]},
  {"三国": [
    朝代("魏", 220, 265),
    朝代("蜀", 221, 263),
    朝代("吴", 222, 280),
  ]},
  朝代("西晋", 265, 317),
  {"东晋十六国": [
    朝代("东晋", 317, 420),
    朝代("十六国", 304, 439),
  ]},
  {"南北朝": [
    {"南朝": [
      朝代("宋", 420, 479),
      朝代("齐", 479, 502),
      朝代("梁", 502, 557),
      朝代("陈", 557, 589),
    ]},
    {"北朝": [
      朝代("北魏", 386, 534),
      朝代("东魏", 534, 550),
      朝代("北齐", 550, 577),
      朝代("西魏", 535, 556),
      朝代("北周", 557, 581)
    ]}
  ]},
  朝代("隋", 581, 618),
  朝代("唐", 618, 907),
  {"五代十国": [
    朝代("后梁", 907, 923),
    朝代("后唐", 923, 936),
    朝代("后晋", 936, 947),
    朝代("后汉", 947, 950),
    朝代("后周", 951, 960),
    朝代("十国", 902, 979)
  ]},
  {"宋": [
    朝代("北宋", 960, 1127),
    朝代("南宋", 1127, 1279),
  ]},
  朝代("辽", 907, 1125),
  朝代("西夏", 1038, 1227),
  朝代("金", 1115, 1234),
  朝代("元", 1206, 1368),
  朝代("明", 1368, 1644),
  朝代("清", 1616, 1911),
  朝代("中华民国", 1912, 1949),
  朝代("中华人民共和国", 1949)
])

function 朝代(名称, 起始年, 结束年) {
  return {名: 名称, 起: 起始年, 止: 结束年}
}

/* 列出所有朝代信息, 来源: 新华字典第 11 版附录"我国历代纪元简表" */
exports.历代 = function() {
  return 原始数据
}

exports.查询 = function(名称) {
  if (! 名称) {
    return []
  }
  var 结果 = []
  for (代 of 原始数据) {
    if (代.名 == 名称) {
      结果.push(代)
    } else if (!代.名) {
      for (时期 in 代) {
        for (时期内代 of 代[时期]) {
          if (时期内代.名 == 名称) {
            结果.push(时期内代)
          }
        }
      }
    }
  }
  return 结果
}
